Revit 2024 API
MetallicPaint Class
 A static class that provides access to the property names that appear in the MetallicPaint visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class MetallicPaint
Visual Basic
Public NotInheritable Class MetallicPaint
Visual C++
public ref class MetallicPaint abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.MetallicPaint
See Also
MetallicPaint Members
Autodesk.Revit.DB.Visual Namespace